Repository: mauyz/portfolio-fluter
Catalog: lib/l10n/intl_*.arb
Languages: fr

# devMobileTitle
source: Mobile application developer
fr: Développeur mobile medior

# masterDegree
source: Professional master
fr: Master professionnel

# licenseDegree
source: Professional license
fr: Licence professionnelle

# consultantDeveloperFlutter
source: Consultant developer
fr: Consultant développeur flutter

# sinceMai2024
source: Since May 2024
fr: Depuis Mai 2024

source: Flutter developer
fr: Développeur flutter

# androidDeveloper
source: Android application developer
fr: Développeur d'application Android

# systemAdministrator
source: Systems and network administrator
fr: Administrateur systèmes et réseaux

source: Internship
fr: Stage

# aboutTitle
source: About
fr: A propos

# experienceTitle
source: Experiences
fr: Expériences

# modeDark
source: Dark mode
fr: Mode sombre

# whoIam
source: Who am I ?
fr: Qui suis-je ?

# bioContent
source: Self-taught developer and a graduate of the Ecole Nationale d'Informatique of Fianarantsoa, Madagascar. I have solid experience in the design, development, and deployment of applications. Over the past four years, I've acquired solid programming expertise in Dart, Java and Kotlin. I have primarily focused on mobile development, utilizing the Flutter framework and Android SDK. Passionate about programming, I regularly dedicate time to staying updated with the latest technological trends and exploring new innovations. I am currently self-learning the React Native and Ionic frameworks to deepen my mobile development skills. At the same time, I am enhancing my knowledge of Spring and Symfony to strengthen my backend expertise and stay updated with technological advancements.
fr: Développeur autodidacte et diplômé de l'École Nationale d'Informatique de Fianarantsoa. Je possède une solide expérience dans la conception, le développement et la mise en production d'applications. Au cours des quatre dernières années, j'ai développé une expertise notable dans les langages Dart, Java et Kotlin. J'ai particulièrement travaillé sur le développement mobile en utilisant le framework Flutter ainsi que l'Android SDK. Passionné par la programmation, je consacre régulièrement du temps à la veille technologique et à l'exploration de nouvelles technologies. Actuellement, je me forme de manière autonome sur le framework Jetpack Compose, qui est en vogue pour les applications cross-plateforme. Parallèlement, je suis une formation sur Spring Boot pour enrichir mes compétences en backend et rester à la pointe des évolutions technologiques.

# introContent
source: I am
fr: Je m'appelle

# softwareIng
source: Software engineer
fr: Ingénieur développeur

source: Home
fr: Accueil

# welcomeTitle
source: Welcome to my portfolio
fr: Bienvenu dans mon portfolio

source: I am
fr: Je suis

# parcourTitle
source: Careers
fr: Parcours

# skillTitle
source: Skills
fr: Compétences

# projectTitle
source: Projects
fr: Projets

# closeTitle
source: Close
fr: Fermer

# cantOpenContactError
source: Unable to open {contactType}
fr: Impossible d'ouvrir {contactType}

# Mailaddress
source: the e-mail address
fr: l'adresse mail

# linkTitle
source: the link
fr: le lien

# academicTitle
source: Academic
fr: Académique

# masterDesc
source: In-depth training in web, mobile and desktop programming Development of network programming skills Advanced administration and security of computer systems and networks
fr: Formation approfondie en programmation web, mobile et desktop Développement des compétences en programmation réseau Administration avancée, sécurisation des systèmes et réseaux informatiques

# licenceDesc
source: Training in the basics of algorithms and programming Training in the administration of computer systems and networks Introduction to relational databases
fr: Formation sur les bases de l'algorithme et de la programmation Formation sur l'administration des systèmes et réseaux informatiques Introduction à la base de données relationnelles

# professionalTitle
source: Professional
fr: Professionnel

# jlConsultingDesc
source: Application maintenance Development of new functionalities Integration of visuals in line with mock-ups and the user experience REST API development in Symfony
fr: Maintenance applicative Développement des nouvelles fonctionnalités Intégration des visuels en respectant les maquettes et l’expérience utilisateur Mise en production Play Store

# neoshoreDesc
source: Collaborate with the team to design and implement new platform functionalities Apply modifications in alignment with technical specifications and requirements Monitor application logs to ensure optimal performance and early issue detection Maintain a high-quality user experience through continuous improvements Enhance performance and resolve bugs to ensure smooth application functionality Manage content updates and oversee the publication of new versions on the Play Store and App Store
fr: Concevoir avec l’équipe les nouvelles fonctionnalités de la plateforme Implémenter les modifications en respectant les exigences techniques Suivre les journaux des applications Maintenir une expérience utilisateur de haute qualité Améliorer les performances et corriger les bugs Gérer le contenu et la publication des mises à jour sur Play Store et App Store

# freelanceDesc
source: Design and development of a clinic management application Development of a dating application for the Comorian and Mahoran community
fr: Conception et développement d’une application de gestion d’un clinique Développement d’une application de rencontre pour la communauté comorienne et mahoraise

# onnOlepDesc
source: Administration and configuration of Linux and Windows servers Automation of recurring tasks using Bash, Shell and PHP scripts Management of a computer park containing 120 workstations
fr: Administration et configuration des serveurs Linux et Windows Automatisation des tâches récurrentes à l’aide de scripts Bash, Shell et PHP Gestion d’un parc informatique contenant 120 postes de travail

# emayaDesc
source: Development of a job search application
fr: Développement d’une application pour la recherche des offres d’emploi

# bacDegree
source: BAC Option C
fr: BAC Série C

# downloadCV
source: Download my resume
fr: Télécharger mon CV

# language
source: Programming languages
fr: Langages de programmations

source: Database
fr: Base des données

# toolsApi
source: Tools and APIs
fr: Outils et API

# quadientDesc
source: Mobile application for collecting company's informations
fr: Application mobile pour collecter des informations via le scan d'un enveloppe

# constitutionDesc
source: Web and mobile application to explore the Constitution of Madagascar
fr: Application web et mobile qui permet d'explorer le contenu de la constitution de Madagascar

# feelinDesc
source: Video analysis platform based on facial expressions and a series of questions
fr: Plateforme d'analyse des vidéos en basant sur les expressions faciales et une suite des questions

# viewMore
source: View on :
fr: Voir sur :

# portfolioDesc
source: This website where I present my career path, my skills and my personal and professional projects
fr: Ce site web où j'expose mes parcours, mes compétences ainsi que mes projets personnels et professionnels

source: Light mode
fr: Mode clair

# careerProIntro
source: My career path in IT has been marked by a number of enriching experiences, both through jobs and internships. These have enabled me to develop solid skills in this constantly evolving field. Here are just a few of the professional experiences I've acquired over the last few years:
fr: Mon parcours professionnel en informatique est marqué par plusieurs expériences enrichissantes, tant au travers d'emplois que de stages. Celles-ci m'ont permis de développer des compétences solides dans ce domaine en constante évolution. Voici quelques-unes des expériences professionnelles que j'ai acquises au cours de ces dernières années :

# careerScholIntro
source: My academic career in IT has been defined by rigorous training, particularly at the Ecole Nationale d'Informatique (ENI) in Fianarantsoa. Prior to that, I earned a scientific baccalaureate, which sparked and solidified my interest in science and technology.
fr: Mon parcours académique en informatique a été marqué par des formations rigoureuses, notamment à l'Ecole Nationale d'Informatique(ENI) de Fianarantsoa. Avant cela, j'ai obtenu un baccalauréat scientifique, qui a posé les bases de mon intérêt pour les sciences et les technologies.

# footerIntro
source: Let's build beautiful things !
fr: Collaborons et construisons des belles choses !

# contactMe
source: If you'd like us to work together, please don't hesitate to contact me.
fr: Si vous voulez qu'on travaille ensemble, n'hésitez pas à me contacter.

# projectIntro
source: I'm pleased to present a selection of my recent development projects. Each of these projects has used a variety of technologies and skills to solve a variety of problems.
fr: Je suis heureux de vous présenter une sélection de mes projets de développement récents. Chacun de ces projets a été réalisé avec diverses technologies et compétences, visant à résoudre une variété de problématiques.

# skillIntro
source: Throughout my career, I have acquired and honed a diverse set of skills in IT development, spanning various programming languages, frameworks, and tools. These competencies allow me to design and implement technical solutions that are tailored to the unique requirements of each project.
fr: Tout au long de mon parcours, j'ai acquis et affiné un ensemble de compétences en développement informatique, couvrant divers langages, frameworks, et outils. Ces compétences me permettent de concevoir et de mettre en œuvre des solutions techniques adaptées aux besoins spécifiques de chaque projet.

# gitHubIntro
source: I also invite you to explore my
fr: Je vous invite aussi à explorer mon dépôt

# gitHubEndIntro
source: , where I share projects and open-source code.
fr: , où je partage des projets et des codes open-sources.

# projectListIntro
source: Explore some of the projects I've worked on.
fr: Explorez quelques-uns des projets sur lesquels j'ai travaillé.
